{
  "backend/main.mo": "Defines trip planning data types, user profiles, authorization, and CRUD-like functions for profiles and trips.",
  "feature_evidence.json": "Feature evidence report mapping two navigation-related features to their affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their roles across the app.",
  "frontend/index.css": "TailwindCSS setup defining light/dark theme color variables and base styling.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication gating, theme provider, and profile initialization logic.",
  "frontend/src/components/AppShell.tsx": "Provides the main layout with header, footer, navigation, and logout handling.",
  "frontend/src/components/SectionHeading.tsx": "Reusable section heading component with emoji and optional description.",
  "frontend/src/features/auth/AuthGate.tsx": "Authentication gate showing a login screen until the user is authenticated.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Modal dialog for entering and saving a user’s display name with validation and toast feedback.",
  "frontend/src/features/budget/BudgetEstimator.ts": "Provides functions to calculate trip budget estimates based on cost assumptions for hotel, transport, food, and attractions.",
  "frontend/src/features/budget/BudgetSection.tsx": "UI for adjusting budget assumptions, recalculating estimates, and saving updates to a trip’s budget.",
  "frontend/src/features/dashboard/TripCard.tsx": "Displays a trip summary card with navigation, duplication, and deletion actions.",
  "frontend/src/features/dashboard/TripsDashboardPage.tsx": "Dashboard page showing a hero section and a grid or empty state for managing trip plans.",
  "frontend/src/features/emergency/EmergencySection.tsx": "Manages emergency contacts for a trip, including adding, deleting, and showing template contacts.",
  "frontend/src/features/emergency/emergencyTemplates.ts": "Generates default emergency contact templates based on the destination.",
  "frontend/src/features/export/print.css": "Print stylesheet defining A4 layout, typography, visibility rules, and color adjustments for printed trip plans.",
  "frontend/src/features/export/TripPlanPrintPage.tsx": "Print-focused page that loads a trip plan, builds packing lists and weather tips, and renders itinerary and accommodations with print controls.",
  "frontend/src/features/todos/todoModels.ts": "Utility functions for todo filtering and status checks such as overdue and due-today.",
  "frontend/src/features/todos/ToDoSection.tsx": "UI for viewing, filtering, adding, and completing trip-related to-dos with dialog and mutation hooks.",
  "frontend/src/features/trip-planner/intakeSchema.ts": "Type definitions and validation for trip intake fields including dates, preferences, and budget info.",
  "frontend/src/features/trip-planner/TripPlannerWizard.tsx": "Multi-step wizard to collect trip intake data, validate inputs, and generate a trip plan before saving it.",
  "frontend/src/features/trips/MapsNavigationSection.tsx": "Renders must-visit places with buttons that open each location in external map apps.",
  "frontend/src/features/trips/TripPlanGenerator.ts": "Generates complete trip plans including itinerary, budget, accommodations, places, food, and transport options based on intake data.",
  "frontend/src/features/trips/TripPlanPage.tsx": "Renders a trip plan page that loads a trip by ID, handles loading/error states, and displays tabbed sections for overview, budget, todos, and emergency info.",
  "frontend/src/features/trips/TripPlanView.tsx": "Displays a detailed trip overview with dates, destination info, generated suggestions, and interactive map links using trip data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading/storing identities and offering login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, trip plans, currencies, and mutations like creating or deleting trips.",
  "frontend/src/index.css": "Defines global Tailwind-based styles and a premium color theme with both light and dark mode palette variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering the main App component.",
  "frontend/src/utils/currency.ts": "Provides helper functions to format amounts as INR currency or plain numbers.",
  "frontend/src/utils/maps.ts": "Generates URL-encoded Google Maps search URLs for destinations and places.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear stored or hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, spacing, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, known issues, and existing feature metadata for the TripMuse travel assistant."
}