{
  "kind": "build_request",
  "title": "Add navigation-to-places links for Goa (and any destination)",
  "projectName": "TripMuse",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add a new “🗺️ Maps & Navigation” section to the Trip Plan overview that helps users reach must-visit places for the trip destination (e.g., Goa) by providing external map links for each place.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i need the maps that if i reached to goa some of the visiting places that should be reached"
        ]
      },
      "acceptanceCriteria": [
        "On the Trip Plan page (TripPlanPage → Overview → TripPlanView), a clearly labeled section named “Maps & Navigation” is visible when the trip has one or more must-visit places.",
        "The section lists each item from the existing Must-Visit Places list and includes an “Open in Maps” action per place.",
        "Clicking “Open in Maps” opens a new browser tab to a maps website search for that place name combined with the trip destination (e.g., \"Basilica of Bom Jesus, Goa\"), using a URL-encoded query.",
        "User-facing text in the new section is in English."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a “View destination in Maps” action near the trip destination header that opens an external map search centered on the trip destination (e.g., Goa).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i need the maps that if i reached to goa some of the visiting places that should be reached"
        ]
      },
      "acceptanceCriteria": [
        "TripPlanView shows a “View destination in Maps” action near the destination display in the hero/header area.",
        "Clicking the action opens a new browser tab to a maps website search for the trip destination using a URL-encoded query.",
        "The feature works for any destination string stored on the trip (not only Goa)."
      ]
    }
  ],
  "constraints": [
    "Do not implement an embedded interactive map, geolocation, or GPS features; use external map links only.",
    "Do not edit any files under frontend/src/components/ui or other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor; no new backend services/databases."
  ],
  "nonGoals": [
    "Turn-by-turn navigation inside the app.",
    "Live user location tracking.",
    "Integrating third-party map SDKs (Google Maps JS SDK, Mapbox GL, etc.).",
    "Automatically calculating routes, distances, or travel time within the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}