{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "TripMuse sky-blue theme refresh (replace sunset orange)",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Switch global color tokens to a sky-blue primary palette while preserving the app’s dark, vibrant, readable look across interactive states.",
      "acceptanceCriteria": [
        "Primary brand color throughout the UI appears sky blue (not sunset orange).",
        "Text, borders, and focus rings maintain accessible contrast on dark surfaces.",
        "No new UI features are introduced; only theming/visual styling changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Replace the current sunset-orange OKLCH values for theme tokens (notably --primary and --ring, and any related token values like charts that represent the primary brand hue) with a sky-blue primary palette while keeping dark-mode readability and contrast for buttons, links, icons, gradients, and interactive states."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Review/adjust any Tailwind theme extensions that embed sunset-orange values (e.g., shadow/color-related tokens) so Tailwind utilities continue to reflect the updated sky-blue brand palette without changing app structure or flows."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update premium shadow/glow styling tokens and utilities to use subtle sky-blue glow values instead of sunset-orange.",
      "acceptanceCriteria": [
        "Cards and elevated surfaces show a subtle sky-blue glow instead of orange.",
        "No regressions to general shadow depth/legibility on dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the reusable premium shadow utility classes (.shadow-premium, .shadow-premium-lg, and their .dark variants) to replace embedded orange glow OKLCH values with subtle sky-blue glow values while preserving shadow depth and legibility on dark surfaces."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update Tailwind boxShadow tokens (premium, premium-lg) to remove sunset-orange glow values and replace them with matching sky-blue glow values, ensuring consistent elevated-surface styling across the app."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Replace the app-wide .app-backdrop overlay gradients with cool-toned sky-blue treatments while preserving layering, opacity, and reduced-motion drift behavior.",
      "acceptanceCriteria": [
        "Backdrop overlay gradients have a sky-blue/cool-toned mood instead of orange/amber.",
        "The background image layer and overlay remain subtle and do not reduce text readability.",
        "Reduced-motion preference continues to disable the drift animation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update .app-backdrop::after and .dark .app-backdrop::after linear-gradient color stops to sky-blue/cool-toned OKLCH values (replacing orange/amber), while keeping z-index layering, opacity behavior, and the existing prefers-reduced-motion-controlled drift animation unchanged."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add the new sky-blue generated backdrop image asset and update .app-backdrop to use it as the background image on both AuthGate and AppShell screens.",
      "acceptanceCriteria": [
        "A new sky-blue background image exists under frontend/public/assets/generated and is used by the .app-backdrop background-image.",
        "The backdrop is visibly applied on both authenticated AppShell screens and the unauthenticated AuthGate screen."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/bg-travel-spiritual-historical-beach-sky-blue.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated asset file: frontend/public/assets/generated/bg-travel-spiritual-historical-beach-sky-blue.dim_1920x1080.png."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update .app-backdrop::before background-image to reference the new generated asset at frontend/public/assets/generated/bg-travel-spiritual-historical-beach-sky-blue.dim_1920x1080.png, keeping existing positioning, attachment, opacity, z-index, and reduced-motion drift behavior intact so it continues to apply on both AppShell and AuthGate (both already use the app-backdrop class)."
        }
      ]
    }
  ]
}